# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
list = [2, 3, 4, 5, 6]
list_new = []
result =0
for i in range(0,(len(list)+1)//2):
    result = list[i]*(list[len(list)-1-i])
    list_new.append(result)
print(list_new)
